{
  "profile": [
    "Experienced Front-End Developer with a strong focus on React, Vue and modern UI development. With over 10 years of proven experience, I specialize in crafting scalable, maintainable, and intuitive user interfaces that enhance user experience across diverse applications.",

    "I have successfully led front-end and back-end architecture projects, including the corporate website for <a href='https://www.networkrail.co.uk' class='hover:underline text-blue-800 dark:text-blue-400'>Network Rail</a>, where I introduced innovative features and design systems. Currently, I am the Lead Front-End Engineer at FlowArchitect, driving the development of AI-powered workflow applications using React and related technologies.",

    "Although my current focus is on front-end development, I have extensive full-stack experience with PHP, particularly in building robust APIs and backend systems in Laravel, Symphony and WordPress",

    "My expertise spans a wide range of tools and frameworks. My approach focuses on delivering efficient, reusable, and high-quality solutions, ensuring technical excellence and user satisfaction."
  ],

  "experience": [
    {
      "title": "Lead Frontend Engeneer",
      "company": "FlowArchitect",
      "type": "Contractor Part time",
      "period": "September 2024 - Present",
      "place": "Full remote, Spain",
      "intro": "As a front-end lead at FlowArchitect, I contribute to building seamless workflow applications that empower developers and businesses to integrate AI effortlessly into their operations. Our mission is to simplify complex processes through open-source, scalable, and flexible solutions, making AI accessible and fostering innovation in intelligent applications.",
      "tasks": [
        "- Leading the development of front-end architecture for AI-driven workflow applications.",
        "- Defining the technical roadmap and architecture for the design workflow project.",
        "- Designing and implementing scalable, maintainable, and reusable UI components using modern frameworks such as React.",
        "- Collaborating with cross-functional teams to translate business requirements into intuitive and efficient user interfaces.",
        "- Integrating APIs and AI tools seamlessly into front-end workflows to deliver intelligent application solutions.",
        "- Leading developers and providing guidance to team members, fostering a collaborative and high-performing engineering culture.",
        "- Conducting code reviews to maintain high standards of quality and technical excellence.",
        "- Working with the product team to prototype and refine new features based on user feedback.",
        "- Implementing automated testing strategies to ensure the reliability and robustness of front-end components."
      ],
      "skills": [
        "Rete.js",
        "React",
        "Astro",
        "Tailwind CSS",
        "Vitest",
        "Playwright"
      ],
      "projects": []
    },
    {
      "title": "Front End Developer",
      "company": "CoVi Analytics",
      "url": "https://www.covianalytics.com/",
      "type": "Contractor Part time",
      "period": "August 2024 - September 2024 | 2 months",
      "place": "Full remote, Spain",
      "intro": "Covi Analytics is a data analytics company that provides businesses with powerful insights into their operations and customer behavior. Building on my previous work from several months ago, this time I focused on improving its core 2 product by working with Vue and TypeScript.",
      "tasks": [
        "- Analyzed the existing codebase of the web app to understand the functionality and architecture of the Vue application.",
        "- Collaborated with the development team to plan the migration process and set achievable goals and milestones.",
        "- Adding TypeScript to the project to improve the codebase.",
        "- Refactored the existing codebase to optimize performance and improve maintainability."
      ],
      "skills": ["Vue.js", "TypeScript", "Tailwind CSS", "Git", "Vite"],
      "projects": []
    },
    {
      "title": "Full Stack Developer",
      "company": "Wod Coach",
      "url": "https://www.wod.coach/",
      "type": "Personal project",
      "period": "Feb 2024 - Present",
      "place": "Full remote, Spain",
      "intro": "Personal project to create a platform to help people to generate the best workout for them.",
      "tasks": [
        "- Design the architecture, development, and maintenance of the platform.",
        "- Define standards and tech stack based on a Laravel API and a Preact frontend over Astro.",
        "- Testing front-end code in multiple browsers to ensure cross-browser compatibility with Vitest and Playwright.",
        "- Testing back-end code to ensure the reliability and robustness of the API with Pest.",
        "- Managing servers and database to ensure optimal performance."
      ],
      "skills": [
        "Preact",
        "TypeScript",
        "Astro",
        "Tailwind CSS",
        "Vitest",
        "Playwright",
        "Laravel",
        "Pest"
      ]
    },
    {
      "title": "Full Stack Developer",
      "company": "Urchin Labs",
      "type": "Contractor Part time",
      "period": "April 2023 - Feb 2024 | 10 months",
      "place": "Full remote, Spain",
      "intro": "Urchin Labs is a startup that is developing a ChatGPT tool to help businesses improve their customer service. The tool uses Natural Language Processing (NLP) techniques to understand customer queries and provide relevant answers. I am currently working on the development of a WordPress plugin that integrates the ChatGPT tool with the client's website, specifically tailored for sites utilizing WooCommerce, enhancing the e-commerce experience with advanced conversational capabilities.",
      "tasks": [
        "- Collaborated with the development team and stakeholders to identify the requirements and specifications for the Chatbot plugin.",
        "- Designed the architecture and functionality of the plugin, including integrating ChatGPT and Pinecone vector database for efficient data retrieval.",
        "- Integrated the plugin with the site's existing database, ensuring data security and privacy.",
        "- Created a user-friendly interface for clients to interact with the Chatbot and receive relevant answers.",
        "- Conducted extensive testing to ensure the plugin's reliability, scalability, and performance.",
        "- Documented the plugin's technical specifications, including installation and usage instructions, for future reference.",
        "- Creating the main site with headless WordPress and Next.js to provide a better user experience."
      ],
      "skills": [
        "WordPress",
        "Pinecone",
        "ChatGPT",
        "Docker",
        "Vue.js",
        "React",
        "Next.js",
        "Tailwind CSS",
        "GraphQL",
        "WooCommerce",
        "Vitest",
        "Playwright"
      ],
      "projects": []
    },
    {
      "title": "Front End Developer",
      "company": "CoVi Analytics",
      "url": "https://www.covianalytics.com/",
      "type": "Contractor Full time",
      "period": "Jan 2023 - April 2023 | 3 months",
      "place": "Full remote, Spain",
      "intro": "Covi Analytics is a data analytics company that provides businesses with powerful insights into their operations and customer behavior. Using advanced data analysis techniques, the company helps clients make data-driven decisions that improve their bottom line. My role was to migrate the company's existing web app from Vue.js to React, ensuring compatibility with existing APIs and features.",
      "tasks": [
        "- Analyzed the existing codebase of the web app to understand the functionality and architecture of the Vue application.",
        "- Collaborated with the development team to plan the migration process and set achievable goals and milestones.",
        "- Migrated the Vue components to React, ensuring compatibility with existing APIs and features.",
        "- Refactored the existing codebase to optimize performance and improve maintainability.",
        "- Implemented testing frameworks and tools to ensure the quality of the migrated application.",
        "- Developed new features and functionalities in the migrated application to meet the client's requirements.",
        "- Provided technical support to the development team during the migration process.",
        "- Documented the migration process and created technical documentation for the migrated application.",
        "- Conducted code reviews to ensure that the migrated codebase adheres to the best practices and coding standards.",
        "- Conducted training sessions for the development team to transfer knowledge on React and ensure smooth maintenance of the migrated application."
      ],
      "skills": [
        "Vue.js",
        "React",
        "TypeScript",
        "Tailwind CSS",
        "GraphQL",
        "Git",
        "JWT",
        "Vite"
      ],
      "projects": []
    },
    {
      "title": "WordPress Developer",
      "company": "Totally Group",
      "url": "https://totally.tech/",
      "type": "Contractor Full time",
      "period": "Jun 2022 - December 2022 | 7 months",
      "place": "Full remote, Spain",
      "intro": "Totally Group is a digital agency that specializes in WordPress development. I worked on several projects for WordPress sites. Responsibilities included implementing new features, fixing existing bugs, coordinating with other developers and project managers, improving code quality, improving technology stacks, and delivering the needs of our clients.",
      "tasks": [],
      "skills": [
        "jQuery",
        "Webpack",
        "Sass",
        "BEM",
        "Git",
        "Sage",
        "Bedrock",
        "Docker",
        "GitLab"
      ],
      "projects": [
        {
          "url": "https://www.startuploans.co.uk/",
          "title": "Start Up Loans"
        },
        {
          "url": "https://www.txone.com/",
          "title": "txOne networks"
        },
        {
          "url": "https://businessdisabilityforum.org.uk/",
          "title": "Business Disability Forum"
        }
      ]
    },
    {
      "title": "Full Stack Web Developer",
      "company": "Network Rail",
      "url": "https://www.networkrail.co.uk/",
      "type": "Full time",
      "period": "Feb 2018 - April 2022 | 4 years and 3 months",
      "place": "Milton Keynes, United Kingdom",
      "intro": "Network Rail is the owner and infrastructure manager of most of the railway network in Great Britain. I worked on several projects for the company's internal systems mainly leading the development of the new corporate website and giving some guidance to other teams and agencies.",
      "tasks": [
        "- Design the architecture, development, and maintenance of the corporate website of the company.",
        "- Lead on the design and implementation of new features and functionality to enhance the user experience.",
        "- Define standards and tech stack with other agencies and teams.",
        "- Custom Gutenberg blocks creation based on Advanced Custom Fields and Vue.js.",
        "- Creation of a design system based on <a href='https://storybook.js.org/' target='_blank' class='hover:underline text-blue-800 dark:text-blue-400'>Storybook</a> to manage all frontend resources of the corporate website.",
        "- Creation of single-page applications and other microsites based on Vue.js.",
        "- Monitor website performance and take appropriate action to ensure optimal performance."
      ],
      "skills": [
        "Vue.js",
        "Vuex",
        "React",
        "TypeScript",
        "Webpack",
        "Tailwind CSS",
        "GraphQL",
        "Git",
        "Laravel",
        "Sage",
        "WP Engine",
        "OAuth",
        "JWT",
        "Algolia",
        "Docker"
      ],
      "projects": [
        {
          "url": "https://www.networkrail.co.uk",
          "title": "Network Rail corporate website"
        },
        {
          "url": "https://www.networkrail.co.uk/careers/careers-search/2",
          "title": "Careers Search"
        },
        {
          "url": "https://duffmancc.github.io/sustainability-at-network-rail/2",
          "title": "Sustainability at Network Rail"
        }
      ]
    },
    {
      "title": "Web Developer",
      "company": "Klood Ltd",
      "url": "https://www.klood.com/",
      "type": "Full time",
      "period": "Nov 2015 - Nov 2017 | 2 years",
      "place": "Milton Keynes, United Kingdom",
      "intro": "Klood is a digital marketing agency based on Milton Keynes that specializes in inbound marketing.",
      "tasks": [
        "- Meeting with clients to discuss website designs and functions.",
        "- Creating custom plugins, themes, and functions for WordPress websites.",
        "- Testing front-end code in multiple browsers to ensure cross-browser compatibility.",
        "- Working with multiple APIs and RESTful Services.",
        "- Buildind reusable code and libraries for future use.",
        "- Optimized pages for page speed using Google Page Speed (API) for Apache to obtain higher rankings on Search Engines (SEM).",
        "- Front-end development using the latest HTML5 and CSS3 techniques, backed by jQuery to enable optimum user experience throughout the websites.",
        "- Working in Agile methodology."
      ],
      "skills": [
        "jQuery",
        "Gulp",
        "Composer",
        "Git",
        "Docker",
        "Bootstrap",
        "Sage",
        "Laravel",
        "cPanel",
        "WooCommerce"
      ],
      "projects": [
        {
          "url": "https://www.vwfsfleet.co.uk",
          "title": "Volkswagen Financial Services"
        },
        {
          "url": "https://www.peachpubs.com",
          "title": "Peach Pubs"
        },
        {
          "url": "https://www.retailthinktank.co.uk",
          "title": "Retail think tank"
        }
      ]
    },
    {
      "title": "Web Developer",
      "company": "Freelance",
      "type": "Full time",
      "period": "Oct 2013 - Oct 2015 | 2 years",
      "place": "Canterbury (UK) and Cáceres (Spain)",
      "intro": "Starting my career as web developer. I worked on several small projects for different clients.",
      "tasks": [],
      "skills": [],
      "projects": []
    }
  ]
}
